Sage-Cat/esp32_csi_sensing_firmware/software/esp32-csi-sensing-firmware/sdkconfig.defaults
# Target and flash
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Use the ESP32-S3 native USB connector for flash and capture.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESPTOOLPY_MONITOR_BAUD=921600

# CSI and sustained serial acquisition.
CONFIG_ESP_WIFI_CSI_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=128
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
# The association callback formats stable BSSID/channel provenance on the
# system event task. The ESP-IDF default 2304-byte stack overflows there on
# this S3 build, so retain explicit headroom for reconnect-heavy operation.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Production-network client behavior: observe the existing network; never
# modify AP/channel configuration. Site credentials stay in sdkconfig.site.
CONFIG_EXAMPLE_CONNECT_WIFI=y
CONFIG_EXAMPLE_CONNECT_ETHERNET=n
CONFIG_EXAMPLE_WIFI_SCAN_METHOD_ALL_CHANNEL=y
CONFIG_EXAMPLE_WIFI_CONNECT_AP_BY_SIGNAL=y
CONFIG_EXAMPLE_WIFI_AUTH_WPA2_PSK=y
CONFIG_EXAMPLE_WIFI_CONN_MAX_RETRY=1000

# Stable research defaults.
CONFIG_CWS_PING_FREQUENCY_HZ=40
CONFIG_CWS_PROBE_PAYLOAD_BYTES=512
CONFIG_CWS_HEARTBEAT_INTERVAL_MS=5000
